In [11]:
#!pip install pandasai
#!pip install pandas

In [5]:
import pandas as pd
from pandasai import PandasAI
from pandasai.llm.openai import OpenAI

df = pd.DataFrame({
    "country": ["United States", "United Kingdom", "France", "Germany", "Italy", "Spain", "Canada", "Australia", "Japan", "China"],
    "happiness_index": [6.94, 7.16, 6.66, 7.07, 6.38, 6.4, 7.23, 7.22, 5.87, 5.12]
})

df

          country  happiness_index
0   United States             6.94
1  United Kingdom             7.16
2          France             6.66
3         Germany             7.07
4           Italy             6.38
5           Spain             6.40
6          Canada             7.23
7       Australia             7.22
8           Japan             5.87
9           China             5.12

In [12]:
llm = OpenAI(api_token="")

pandas_ai = PandasAI(llm, conversational=False)

In [14]:
pandas_ai(df, prompt='Cuales son los 5 paises mas felices?')

0     United States
1    United Kingdom
2            France
3           Germany
4             Italy
Name: country, dtype: object

In [15]:
employees_data = {
    'EmployeeID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Emma', 'Liam', 'Olivia', 'William'],
    'Department': ['HR', 'Sales', 'IT', 'Marketing', 'Finance']
}

salaries_data = {
    'EmployeeID': [1, 2, 3, 4, 5],
    'Salary': [5000, 6000, 4500, 7000, 5500]
}

employees_df = pd.DataFrame(employees_data)
salaries_df = pd.DataFrame(salaries_data)

In [16]:
employees_df

   EmployeeID     Name Department
0           1     John         HR
1           2     Emma      Sales
2           3     Liam         IT
3           4   Olivia  Marketing
4           5  William    Finance

In [17]:
salaries_df

   EmployeeID  Salary
0           1    5000
1           2    6000
2           3    4500
3           4    7000
4           5    5500

In [20]:
pandas_ai([employees_df, salaries_df], "Como se llama el empleado mejor pagado y cuanto gana?")

'The highest paid employee is Olivia and they earn 7000 pesos.\n'

In [21]:
#https://www.kaggle.com/datasets/omarsobhy14/population-growth-from-1950?resource=download
population = pd.read_csv("./Population_Growth.csv")

In [22]:
population

    Year Population Growth Rate Growth Rate
0   1950          2,499,322,157       0.00%
1   1951          2,543,130,380       1.75%
2   1952          2,590,270,899       1.85%
3   1953          2,640,278,797       1.93%
4   1954          2,691,979,339       1.96%
..   ...                    ...         ...
69  2019          7,764,951,032       1.06%
70  2020          7,840,952,880       0.98%
71  2021          7,909,295,151       0.87%
72  2022          7,975,105,156       0.83%
73  2023          8,045,311,447       0.88%

[74 rows x 3 columns]

In [24]:
pandas_ai(population, prompt='Cual fue el año con mayor crecimiento de poblacion y que porcentaje creció?')

'   Year Population Growth Rate Growth Rate\n0  1950          2,499,322,157       0.00%\n1  1951          2,543,130,380       1.75%\n2  1952          2,590,270,899       1.85%\n3  1953          2,640,278,797       1.93%\n4  1954          2,691,979,339       1.96%\nThe year with the highest population growth rate was 1964 with a growth rate of 2.24%.\n'

In [27]:
filtered_data = pandas_ai(population, prompt='regresame un dataframe que contenga los registros cuyo Growth Rate es mayor o igual a 2%')

In [28]:
filtered_data

    Year Population Growth Rate  Growth Rate
5   1955          2,746,072,141         2.01
6   1956          2,801,002,631         2.00
7   1957          2,857,866,857         2.03
8   1958          2,916,108,097         2.04
13  1963          3,195,779,247         2.21
14  1964          3,267,212,338         2.24
15  1965          3,337,111,983         2.14
16  1966          3,406,417,036         2.08
17  1967          3,475,448,166         2.03
18  1968          3,546,810,808         2.05
19  1969          3,620,655,275         2.08
20  1970          3,695,390,336         2.06
21  1971          3,770,163,092         2.02

In [31]:
pandas_ai(population, prompt='Haz un grafico de linea en donde el eje X sea la variable Year y el eje Y sea la columna Growth Rate')

'Unfortunately, I was not able to answer your question, because of the following error:\n\nIncorrect API key provided: sk-ej4oG***************************************Btjp. You can find your API key at https://platform.openai.com/account/api-keys.\n'